Revit 2018 API
AssetProperty Methods
The AssetProperty type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetAllConnectedProperties
 Gets the list of the connected properties. Connected properties are the detachable properties of an AssetProperty. e.g. diffuse property can have texture as its connected property. It can also detach texture on runtime.
GetConnectedPropertiesNames
 Gets names of all connected properties.
GetConnectedProperty(Int32)
 Gets one connected property with specified index.
GetConnectedProperty(String)
 Gets a connected property by its name.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
GetTypeName
Get the name of the AssetProperty
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
AssetProperty Class
Autodesk.Revit.DB.Visual Namespace